pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at.globals.c
// bl602_demo_at.globals.c
// Generated by decompiling bl602_demo_at.elf
// using Reko decompiler version 0.9.3.0.

#include "bl602_demo_at.h"

Eq_2 g_a0000[];
Eq_2 g_a0001[];
Eq_2 g_t0002;
Eq_2 g_a0003[];
Eq_2 g_a0004[];
Eq_2 g_a0005[];
Eq_2 g_a0006[];
Eq_2 g_a0007[];
Eq_2 g_a0008[];
Eq_2 g_t0009;
Eq_2 g_t000A;
Eq_2 g_t000B;
Eq_2 g_a000C[];
Eq_2 g_t000D;
Eq_2 g_t000E;
Eq_2 g_t000F;
Eq_2 g_t0010;
Eq_2 g_t0011;
Eq_2 g_t0012;
Eq_2 g_t0013;
Eq_2 g_t0014;
Eq_2 g_t0015;
Eq_2 g_t0016;
Eq_2 g_t0017;
Eq_2 g_t0018;
Eq_2 g_t0019;
Eq_2 g_t001A;
Eq_2 g_t001B;
Eq_2 g_t001C;
Eq_2 g_t001D;
uint16 g_w001E;
Eq_2 g_t001F;
Eq_2 g_t0020;
Eq_2 g_t0021;
Eq_2 g_t0022;
Eq_2 g_t0023;
Eq_2 g_t0024;
Eq_2 g_t0025;
ptr32 g_ptr0026;
Eq_2 g_t0027;
Eq_2 g_t0028;
Eq_2 g_t0029;
Eq_2 g_t002A;
Eq_2 g_t002B;
Eq_71486 g_t002C;
Eq_2 g_t002D;
word32 g_dw002E;
Eq_393154 g_t002F;
Eq_2 g_t0030;
Eq_2 g_t0031;
Eq_2 g_t0032;
Eq_2 g_t0033;
Eq_2 g_t0034;
Eq_2 g_t0035;
Eq_2 g_t0036;
Eq_2 g_t0037;
Eq_2 g_a0038[];
Eq_2 g_t0039;
Eq_2 g_t003A;
Eq_2 g_a003C[];
Eq_2 g_t003D;
Eq_2 g_t003F;
Eq_2 g_a0040[];
Eq_2 g_t0041;
Eq_162541 g_t0042;
Eq_2 g_t0043;
struct Eq_6298 * g_ptr0044;
Eq_2 g_t0045;
uint16 g_w0046;
Eq_2 g_t0048;
word32 g_dw0049;
struct Eq_247223 * g_ptr004B;
word32 g_dw004C;
Eq_2 g_t004D;
Eq_474433 g_t004E;
Eq_127708 g_t004F;
Eq_2 g_t0050;
Eq_2 g_t0051;
Eq_2 g_t0058;
word32 g_dw0059;
struct Eq_363757 * g_ptr005A;
struct Eq_363757 * g_ptr005B;
Eq_2 g_t005C;
word32 g_dw005D;
struct Eq_471318 * g_ptr005E;
Eq_14525 g_t005F;
ptr32 g_ptr0060;
Eq_2 g_t0061;
byte g_b0062;
Eq_2 g_t0063;
Eq_2 g_t0064;
Eq_2 g_t0065;
Eq_2 g_t0066;
Eq_2 g_t0068;
word32 g_dw0069;
Eq_2 g_t006A;
Eq_2 g_t006B;
word32 g_a006C[];
Eq_345921 g_t006D;
Eq_124602 g_t006E;
Eq_2 g_t0071;
Eq_2 g_t0073;
Eq_2 g_t0074;
struct Eq_67419 * g_ptr0075;
struct Eq_479331 * g_ptr0076;
uint16 g_w0077;
Eq_92179 g_t0078;
Eq_2 g_t0079;
Eq_2 g_t007A;
word32 g_dw007B;
Eq_2 g_t007C;
word32 g_dw007D;
uint16 g_w007F;
Eq_2 g_t0080;
Eq_2 g_t0084;
uint16 g_w0088;
word32 g_dw008C;
Eq_2 g_t0094;
Eq_2 g_t0098;
Eq_2 g_t009C;
word32 g_dw00A0;
Eq_582893 g_a00A1[];
Eq_582856 g_a00A5[];
Eq_2 g_t00A9;
Eq_2 g_t00AA;
Eq_42948 g_t00B0;
byte g_b00B2;
word32 g_dw00BF;
Eq_42948 g_t00C0;
word32 g_dw00CB;
Eq_2 g_t00D0;
<anonymous> * g_ptr00D4;
struct Eq_62008 * g_ptr00E0;
byte g_a00EF[];
struct Eq_399324 * g_ptr00F0;
Eq_19836 g_t00FF;
word32 g_dw0100;
Eq_123277 g_t0104;
byte g_b010A;
Eq_32070 g_t0111;
Eq_2 g_t0118;
word32 g_dw011C;
Eq_582589 g_a0120[];
Eq_2 g_t0140;
Eq_6885 g_t014D;
struct Eq_77581 * g_ptr0167;
ptr32 g_ptr0190;
Eq_14113 g_t01DC;
Eq_391374 g_t01F4;
Eq_6885 g_t0200;
Eq_2 g_t0208;
Eq_2 g_t0218;
Eq_131195 g_t0270;
Eq_2 g_a02C5[];
struct Eq_6667 * g_ptr0330;
Eq_2 g_t03A2;
word32 g_dw03AE;
struct Eq_151939 * g_ptr03FA;
Eq_525914 g_t0400;
word32 g_dw0414;
Eq_2 g_t0450;
Eq_142008 g_t04E2;
int32 g_dw0563;
Eq_42755 g_t05D8;
byte g_b05EF;
Eq_142600 g_t0604;
Eq_97413 g_t07FF;
word32 g_dw080F;
word32 g_dw1484;
Eq_583584 g_t4345;
Eq_2 g_t2F336;
ptr32 g_ptr34004;
Eq_2 g_t40017;
word32 g_dw40071;
Eq_2 g_t40075;
Eq_131057 g_t40703;
Eq_131057 g_t40783;
word32 g_dw50005;
Eq_2 g_t5E442;
word32 g_dw60003;
Eq_2 g_t80016;
word32 g_dw9280C;
word32 g_dwA007C;
Eq_2 g_tC0016;
word32 g_dwF424C;
word32 g_dwF427C;
Eq_99351 g_tFAC05;
struct Eq_124621 * g_ptr100100;
Eq_2 g_t1B013F;
word32 g_dw1E8494;
word32 g_dw1E84B4;
word32 g_dw1E84D4;
struct Eq_124621 * g_ptr200204;
word32 g_dw2191CC;
word32 g_dw2DC6EC;
word32 g_dw2DC71C;
Eq_391862 g_t3C0000;
ptr32 g_ptr400000;
Eq_14654 g_t4C4B40;
word32 g_dw4C4B5C;
byte g_b512E79;
word32 g_dw557344;
word32 g_dw5B8D84;
word32 g_dw5B8DB4;
word32 g_dw6ACFCC;
word32 g_dw6ACFEC;
word32 g_dw6AD00C;
word32 g_dw6DDD04;
word32 g_dw7A1224;
word32 g_dw7A1254;
word32 g_dw7A1264;
Eq_2 g_t7F004C;
word32 g_dw989694;
Eq_336737 g_tFCF8F0;
Eq_348146 g_tFF0000;
Eq_130351 g_tFF0003;
word32 g_dwFF0103;
Eq_2 g_tFFF801;
Eq_2 g_tFFF802;
Eq_2 g_tFFF803;
byte g_bFFF804;
byte g_bFFF805;
byte g_bFFF806;
byte g_bFFF807;
Eq_406304 g_tFFF810;
Eq_2 g_tFFF83C;
struct Eq_14391 * g_ptrFFF9A8;
Eq_37232 g_tFFF9B4;
word32 g_dwFFF9F1;
Eq_21468 g_tFFFA47;
Eq_2 g_tFFFA4F;
Eq_425892 g_tFFFAC0;
Eq_2 g_tFFFB7D;
Eq_2 g_tFFFC04;
Eq_2 g_tFFFC05;
Eq_2 g_tFFFC40;
Eq_2 g_tFFFC41;
Eq_2 g_tFFFD00;
Eq_2 g_tFFFD01;
Eq_2 g_tFFFFFC;
Eq_416265 g_t100011C;
Eq_2 g_t1000389;
Eq_42948 g_t1000400;
word32 g_dw100C9AB;
Eq_2 g_t1480894;
word32 g_dw2000000;
Eq_275785 g_t2000005;
struct Eq_19685 * g_ptr200006C;
Eq_2 g_t2000206;
struct Eq_42129 * g_ptr2000234;
Eq_530192 g_t2000710;
struct Eq_489953 * g_ptr200072C;
Eq_2 g_t200BFF8;
Eq_2 g_t200BFFC;
Eq_2 g_t219002F;
byte g_a2800000[129];
byte g_b2800080;
byte g_a2800400[129];
byte g_b2800407;
byte g_b2800480;
Eq_268487 g_t3000000;
Eq_19233 g_t3000020;
struct Eq_19685 * g_ptr300006C;
Eq_2 g_t3030373;
word32 g_dw37FF1F7;
Eq_129527 g_t3FFFFFE;
word32 g_dw5000107;
Eq_521732 g_t501062B;
Eq_2 g_t5040000;
Eq_537297 g_t6050007;
Eq_349221 g_t7000012;
Eq_225931 g_t7000530;
Eq_349221 g_t7FFFFEC;
Eq_348745 g_t8000000;
Eq_199488 g_t8000003;
Eq_216787 g_t8000007;
Eq_199488 g_t8000044;
Eq_2 g_t800004F;
Eq_2 g_t8100838;
Eq_102150 g_t8FFF88E;
Eq_2 g_t8FFF9F3;
ptr32 g_ptrA000008;
word32 g_dwA027FB3;
Eq_2 g_tAF60090;
Eq_2 g_tC000000;
struct Eq_77581 * g_ptrCFFF967;
Eq_2 g_tEFFFACC;
Eq_87168 g_tF230204;
word32 g_dwF690690;
word32 g_dwF6F96FD;
word32 g_dwF76276A;
word32 g_dwF7CB7D7;
word32 g_dwF834845;
word32 g_dwF89D8B2;
word32 g_dwF90691F;
word32 g_dwF96F98C;
word32 g_dwF9D89F9;
word32 g_dwFA41A66;
word32 g_dwFAAAAD3;
word32 g_dwFB13B40;
word32 g_dwFB7CBAD;
word32 g_dwFBE5C1A;
word32 g_dwFC4EC87;
word32 g_dwFCB7CF4;
word32 g_dwFD20D61;
word32 g_dwFD89DCE;
word32 g_dwFDF2E3B;
word32 g_dwFE5BEA8;
word32 g_dwFEC4F15;
Eq_397235 g_tFFFFEA9;
Eq_16184 g_tFFFFFFF;
Eq_2 g_t10000025;
Eq_2 g_t10000054;
Eq_2 g_t1000008C;
word32 g_dw1000033A;
struct Eq_151671 * g_ptr10000346;
struct Eq_92191 * g_ptr10325482;
struct Eq_549992 * g_ptr1032548A;
Eq_2 g_t1111111D;
Eq_2 g_t11111121;
word32 g_dw14088889;
word32 g_dw14111115;
word32 g_dw141999A2;
word32 g_dw1422222E;
word32 g_dw142AAABB;
word32 g_dw14333347;
word32 g_dw143BBBD4;
word32 g_dw14444460;
word32 g_dw144CCCED;
word32 g_dw14555579;
word32 g_dw145DDE06;
word32 g_dw14666692;
word32 g_dw146EEF1F;
word32 g_dw147777AB;
word32 g_dw14800038;
word32 g_dw148888C5;
word32 g_dw14911151;
word32 g_dw149999DE;
word32 g_dw14A2226A;
word32 g_dw14AAAAF7;
word32 g_dw14B33383;
word32 g_dw14DE38E4;
word32 g_dw14E71C76;
word32 g_dw14F00008;
word32 g_dw14F8E39A;
struct Eq_62008 * g_ptr15000194;
word32 g_dw1501C72C;
word32 g_dw150AAABF;
word32 g_dw15138E51;
word32 g_dw151C71E3;
word32 g_dw15255575;
word32 g_dw152E3908;
word32 g_dw15371C9A;
word32 g_dw1540002C;
word32 g_dw1548E3BE;
word32 g_dw1551C750;
word32 g_dw155AAAE3;
word32 g_dw15638E75;
word32 g_dw156C7207;
word32 g_dw15755599;
word32 g_dw157E392C;
Eq_2 g_t15800049;
word32 g_dw15871CBE;
word32 g_dw15900050;
Eq_2 g_t19000004;
word32 g_dw190AAAAB;
word32 g_dw19155559;
word32 g_dw19200008;
word32 g_dw192AAAB7;
word32 g_dw19355565;
word32 g_dw19400014;
word32 g_dw194AAAC3;
word32 g_dw19555571;
word32 g_dw19600020;
word32 g_dw196AAACF;
word32 g_dw1975557D;
word32 g_dw1980002C;
word32 g_dw198AAADB;
word32 g_dw19955589;
word32 g_dw19A00038;
word32 g_dw19AAAAE7;
word32 g_dw19B55595;
word32 g_dw19C00044;
word32 g_dw19CAAAF3;
word32 g_dw19D555A1;
word32 g_dw19E00050;
word32 g_dw1C000204;
byte g_b1C000208;
byte g_b1C000209;
byte g_b1C00020A;
byte g_b1C00020B;
byte g_b1C00020C;
word32 g_dw1ED20D21;
word32 g_dw1EDF2DF7;
word32 g_dw1EEC4ECD;
word32 g_dw1EF96FA3;
Eq_71626 g_t1EFFF848;
word32 g_dw1F069079;
word32 g_dw1F13B14F;
word32 g_dw1F20D225;
word32 g_dw1F2DF2FB;
word32 g_dw1F3B13D1;
word32 g_dw1F4834A7;
word32 g_dw1F55557D;
word32 g_dw1F627653;
word32 g_dw1F6F9729;
word32 g_dw1F7CB7FF;
Eq_2 g_t1F83D9CB;
word32 g_dw1F89D8D6;
word32 g_dw1F96F9AC;
word32 g_dw1FA41A82;
word32 g_dw1FB13B58;
word32 g_dw1FBE5C2E;
word32 g_dw1FCB7D04;
word32 g_dw1FD89DDA;
word32 g_dw20002000;
word32 g_dw20171080;
<anonymous> * g_ptr21010810;
<anonymous> * g_ptr21010814;
<anonymous> * g_ptr21010818;
<anonymous> * g_ptr2101081C;
<anonymous> * g_ptr21010820;
<anonymous> * g_ptr21010824;
<anonymous> * g_ptr21010828;
<anonymous> * g_ptr2101082C;
<anonymous> * g_ptr21010830;
<anonymous> * g_ptr21010834;
<anonymous> * g_ptr21010838;
<anonymous> * g_ptr2101083C;
<anonymous> * g_ptr21010840;
<anonymous> * g_ptr21010844;
<anonymous> * g_ptr21010848;
<anonymous> * g_ptr2101084C;
<anonymous> * g_ptr21010850;
<anonymous> * g_ptr21010854;
<anonymous> * g_ptr21010858;
<anonymous> * g_ptr2101085C;
<anonymous> * g_ptr21010860;
<anonymous> * g_ptr21010864;
<anonymous> * g_ptr21010868;
<anonymous> * g_ptr2101086C;
<anonymous> * g_ptr21010870;
<anonymous> * g_ptr21010874;
<anonymous> * g_ptr21010878;
<anonymous> * g_ptr2101087C;
<anonymous> * g_ptr21010880;
<anonymous> * g_ptr21010884;
<anonymous> * g_ptr21010888;
<anonymous> * g_ptr2101088C;
<anonymous> * g_ptr21010890;
<anonymous> * g_ptr21010894;
<anonymous> * g_ptr21010898;
<anonymous> * g_ptr2101089C;
<anonymous> * g_ptr210108A0;
<anonymous> * g_ptr210108A4;
<anonymous> * g_ptr210108A8;
<anonymous> * g_ptr210108AC;
<anonymous> * g_ptr210108B0;
<anonymous> * g_ptr210108B4;
<anonymous> * g_ptr210108B8;
<anonymous> * g_ptr210108BC;
<anonymous> * g_ptr210108C0;
<anonymous> * g_ptr210108C4;
<anonymous> * g_ptr210108C8;
<anonymous> * g_ptr210108CC;
<anonymous> * g_ptr210108D0;
<anonymous> * g_ptr210108D4;
<anonymous> * g_ptr210108D8;
<anonymous> * g_ptr210108DC;
<anonymous> * g_ptr210108E0;
<anonymous> * g_ptr210108E4;
<anonymous> * g_ptr210108E8;
<anonymous> * g_ptr210108EC;
<anonymous> * g_ptr210108F0;
<anonymous> * g_ptr210108F4;
<anonymous> * g_ptr210108F8;
<anonymous> * g_ptr210108FC;
<anonymous> * g_ptr21010900;
<anonymous> * g_ptr21010904;
<anonymous> * g_ptr21010908;
<anonymous> * g_ptr2101090C;
<anonymous> * g_ptr21010910;
<anonymous> * g_ptr21010914;
<anonymous> * g_ptr21010918;
<anonymous> * g_ptr2101091C;
<anonymous> * g_ptr21010920;
<anonymous> * g_ptr21010924;
<anonymous> * g_ptr21010928;
<anonymous> * g_ptr2101092C;
<anonymous> * g_ptr21010930;
<anonymous> * g_ptr21010934;
<anonymous> * g_ptr21010938;
<anonymous> * g_ptr2101093C;
<anonymous> * g_ptr21010940;
<anonymous> * g_ptr21010948;
<anonymous> * g_ptr2101094C;
<anonymous> * g_ptr21010950;
<anonymous> * g_ptr21010954;
<anonymous> * g_ptr21010958;
<anonymous> * g_ptr2101095C;
<anonymous> * g_ptr21010960;
<anonymous> * g_ptr21010964;
<anonymous> * g_ptr21010968;
<anonymous> * g_ptr2101096C;
<anonymous> * g_ptr21010970;
<anonymous> * g_ptr21010974;
<anonymous> * g_ptr21010978;
<anonymous> * g_ptr2101097C;
<anonymous> * g_ptr21010980;
<anonymous> * g_ptr21010984;
<anonymous> * g_ptr21010988;
<anonymous> * g_ptr2101098C;
<anonymous> * g_ptr21010990;
<anonymous> * g_ptr21010994;
<anonymous> * g_ptr21010998;
<anonymous> * g_ptr2101099C;
<anonymous> * g_ptr210109A0;
<anonymous> * g_ptr210109A4;
<anonymous> * g_ptr210109A8;
<anonymous> * g_ptr210109AC;
<anonymous> * g_ptr210109B0;
<anonymous> * g_ptr210109B4;
<anonymous> * g_ptr210109B8;
<anonymous> * g_ptr210109BC;
<anonymous> * g_ptr210109C0;
<anonymous> * g_ptr210109C4;
<anonymous> * g_ptr210109C8;
<anonymous> * g_ptr210109CC;
<anonymous> * g_ptr210109D0;
<anonymous> * g_ptr210109D4;
<anonymous> * g_ptr210109D8;
<anonymous> * g_ptr210109DC;
<anonymous> * g_ptr210109E0;
<anonymous> * g_ptr210109E4;
<anonymous> * g_ptr210109E8;
<anonymous> * g_ptr210109EC;
<anonymous> * g_ptr210109F0;
<anonymous> * g_ptr210109F4;
<anonymous> * g_ptr210109F8;
<anonymous> * g_ptr210109FC;
<anonymous> * g_ptr21010A00;
<anonymous> * g_ptr21010A04;
<anonymous> * g_ptr21010A0C;
<anonymous> * g_ptr21010A10;
<anonymous> * g_ptr21010A14;
<anonymous> * g_ptr21010A18;
<anonymous> * g_ptr21010A1C;
<anonymous> * g_ptr21010A20;
<anonymous> * g_ptr21010A24;
<anonymous> * g_ptr21010A28;
<anonymous> * g_ptr21010A2C;
<anonymous> * g_ptr21010A30;
<anonymous> * g_ptr21010A34;
<anonymous> * g_ptr21010A38;
<anonymous> * g_ptr21010A3C;
<anonymous> * g_ptr21010A40;
<anonymous> * g_ptr21010A44;
<anonymous> * g_ptr21010A48;
<anonymous> * g_ptr21010A4C;
<anonymous> * g_ptr21010A50;
<anonymous> * g_ptr21010A54;
<anonymous> * g_ptr21010A58;
<anonymous> * g_ptr21010A5C;
<anonymous> * g_ptr21010A60;
<anonymous> * g_ptr21010A64;
<anonymous> * g_ptr21010A68;
<anonymous> * g_ptr21010A6C;
<anonymous> * g_ptr21010A70;
<anonymous> * g_ptr21010A74;
<anonymous> * g_ptr21010A78;
<anonymous> * g_ptr21010A7C;
<anonymous> * g_ptr21010A80;
<anonymous> * g_ptr21010A84;
<anonymous> * g_ptr21010A88;
<anonymous> * g_ptr21010A8C;
<anonymous> * g_ptr21010A90;
<anonymous> * g_ptr21010A94;
<anonymous> * g_ptr21010A98;
<anonymous> * g_ptr21010A9C;
<anonymous> * g_ptr21010AA0;
<anonymous> * g_ptr21010AA4;
<anonymous> * g_ptr21010AA8;
<anonymous> * g_ptr21010AAC;
<anonymous> * g_ptr21010AB0;
<anonymous> * g_ptr21010AB4;
<anonymous> * g_ptr21010AB8;
<anonymous> * g_ptr21010ABC;
word32 g_dw21638E39;
word32 g_dw2171C720;
word32 g_dw21800008;
word32 g_dw218E38F0;
word32 g_dw219C71D7;
word32 g_dw21AAAABF;
word32 g_dw21B8E3A6;
word32 g_dw21C71C8E;
word32 g_dw21D55575;
word32 g_dw21E38E5D;
word32 g_dw21F1C744;
word32 g_dw2200002C;
word32 g_dw220E3914;
word32 g_dw221C71FB;
Eq_2 g_t22222232;
word32 g_dw222AAAE3;
word32 g_dw2238E3CA;
word32 g_dw22471CB2;
word32 g_dw22555599;
word32 g_dw22638E81;
word32 g_dw2271C768;
word32 g_dw22800050;
struct Eq_374235 * g_ptr22FFF000;
word32 g_dw2328234F;
uint32 g_dw28000000;
word32 g_dw2800000C;
word32 g_dw28000050;
int32 g_dw28000080;
word32 g_dw28000090;
word32 g_dw280000A0;
ui32 g_dw280000C4;
ui32 g_dw280000C8;
ui32 g_dw280000CC;
ui32 g_dw280000D0;
int32 g_dw280000E0;
struct Eq_136668 * g_ptr280000F4;
struct Eq_129527 * g_ptr280000F8;
word32 g_dw280001A4;
int32 g_dw280001A8;
Eq_137626 g_t280001AC;
Eq_582810 g_a28008000[17];
Eq_151758 g_t28008040;
Eq_582783 g_a28008054[5];
Eq_142007 g_t280080A2;
uint16 g_a280080EE[];
word16 g_a280080FE[];
word16 g_a28008134[];
byte g_b28008137;
uint16 g_w28008146;
word16 g_w28008148;
uint16 g_w2800814A;
word16 g_w2800814C;
word16 g_w2800814E;
word16 g_w28008150;
word16 g_w28008152;
uint16 g_w28008154;
uint16 g_w28008156;
uint16 g_w28008158;
word16 g_w2800815A;
word16 g_w28008160;
word16 g_w28008162;
word16 g_w28008164;
word16 g_w28008166;
word16 g_w28008168;
word16 g_w2800816A;
word16 g_w28008184;
word16 g_w28008186;
word16 g_w28008188;
uint16 g_w2800818A;
word16 g_w2800818C;
word16 g_w2800818E;
uint16 g_w28008194;
word16 g_w28008196;
uint16 g_w28008198;
word16 g_w2800819A;
word16 g_w2800819C;
uint16 g_w2800819E;
uint16 g_w280081A0;
uint16 g_w280081A2;
word16 g_w280081A4;
uint16 g_w280081A6;
word16 g_w280081A8;
word16 g_w280081AA;
word16 g_w280081AC;
word16 g_w280081AE;
word16 g_w280081B0;
word16 g_w280081B2;
word16 g_w280081B4;
word16 g_w280081B6;
word16 g_w280081BA;
word16 g_w280081BC;
word16 g_w280081BE;
word16 g_w280081C0;
word16 g_w280081C2;
word16 g_w280081C4;
word16 g_w280081C6;
word16 g_w280081F0;
word16 g_w280081F2;
word16 g_w280081F4;
word16 g_w280081F6;
word16 g_w280081F8;
uint16 g_w280081FA;
Eq_138607 g_t2800820E;
uint16 g_w2800822E;
uint16 g_w28008262;
uint16 g_w28008296;
Eq_582760 g_a280082CC[];
uint16 g_w280082CE;
word16 g_a280082D4[];
word16 g_a280082D6[];
word16 g_a280082D8[];
uint16 g_a280082DC[];
word16 g_w280082EA;
uint16 g_w280082F4;
uint16 g_w280082FE;
Eq_582769 g_a28008308[];
Eq_582777 g_a280083D2[];
Eq_138549 g_t280083D6;
Eq_582782 g_a28009042[5];
Eq_582764 g_a280092CA[];
Eq_582773 g_a28009306[];
Eq_582775 g_a280093CE[];
Eq_421201 g_t28040413;
Eq_350252 g_t30344645;
Eq_2 g_t30344651;
Eq_2 g_t3070DD27;
Eq_2 g_t33333347;
Eq_2 g_t367CD513;
Eq_521732 g_t3C203D20;
Eq_2 g_t3C6EF382;
Eq_131057 g_t3EA78503;
struct Eq_246003 * g_ptr40000000;
struct Eq_246002 * g_ptr40000034;
struct Eq_246002 * g_ptr40000038;
int32 g_dw400000A4;
int32 g_dw400000C0;
word32 g_dw400000D0;
word32 g_dw400000D4;
word32 g_dw400000D8;
word32 g_dw400000DC;
Eq_73912 g_t400000E0;
int32 g_a40000180[];
Eq_5868 g_t40001000;
int32 g_dw40001014;
int32 g_dw4000101C;
int32 g_dw40001020;
struct Eq_13556 * g_ptr40001048;
int32 g_dw40001080;
int32 g_dw40001084;
int32 g_dw4000108C;
int32 g_dw400010A0;
int32 g_dw400010A4;
Eq_13256 g_t400010A8;
Eq_13227 g_t400010AC;
int32 g_dw400010B8;
int32 g_dw400010BC;
int32 g_dw400010C0;
int32 g_dw400010C4;
struct Eq_12556 * g_ptr400010F0;
int32 g_dw40001118;
struct Eq_12223 * g_ptr4000111C;
int32 g_dw40001120;
int32 g_dw40001124;
ui32 g_a4000113C[];
int32 g_dw40001168;
int32 g_dw4000116C;
int32 g_dw40001180;
int32 g_dw40001184;
int32 g_dw40001188;
int32 g_dw4000118C;
Eq_13026 g_t40001190;
Eq_13046 g_t40001194;
Eq_13066 g_t40001198;
int32 g_dw4000119C;
int32 g_dw400011A0;
int32 g_dw400011A4;
int32 g_dw400011A8;
int32 g_dw400011AC;
int32 g_dw400011C0;
int32 g_dw400011C4;
int32 g_dw400011C8;
int32 g_dw400011CC;
int32 g_dw4000120C;
int32 g_dw40001214;
Eq_12538 g_t40001218;
struct Eq_10212 * g_ptr40001220;
Eq_73796 g_t40001224;
int32 g_dw40001228;
int32 g_dw4000123C;
int32 g_dw40001240;
int32 g_dw40001244;
int32 g_dw4000126C;
int32 g_dw40001600;
int32 g_dw4000160C;
ptr32 * g_ptr40001618;
Eq_12514 g_t4000161C;
int32 g_dw40001620;
int32 g_dw40001624;
int32 g_dw40001630;
int32 g_dw40001634;
int32 g_dw40001638;
int32 g_dw4000163C;
int32 g_dw40001640;
int32 g_dw40001648;
int32 g_dw40001700;
int32 g_dw40002808;
int32 g_dw4000280C;
int32 g_dw40002810;
int32 g_dw40002850;
int32 g_dw40002854;
int32 g_dw40002CAC;
ui32 g_dw40003808;
ui32 g_dw4000380C;
ui32 g_dw40003810;
struct Eq_155778 * g_ptr40003850;
ui32 g_dw40003854;
ui32 g_dw40003CAC;
Eq_477579 g_t40004000;
Eq_367931 g_t40004200;
word32 * g_ptr40004208;
struct Eq_368002 * g_ptr4000420C;
struct Eq_368007 * g_ptr40004210;
struct Eq_368012 * g_ptr40004214;
struct Eq_368017 * g_ptr40004218;
struct Eq_368022 * g_ptr4000421C;
struct Eq_367966 * g_ptr40004220;
struct Eq_367967 * g_ptr40004224;
struct Eq_64398 * g_ptr4000422C;
ui32 g_dw40004230;
Eq_137820 g_t40004300;
Eq_131720 g_t40004340;
Eq_6183 g_t40007000;
uint32 g_dw40007004;
uint32 g_dw40007008;
uint32 g_dw4000700C;
uint32 g_dw40007014;
uint32 g_dw4000706C;
uint32 g_dw40007070;
uint32 g_dw40007078;
ptr32 g_ptr4000A000;
int32 g_dw4000A500;
word32 g_dw4000A540;
word32 g_dw4000A544;
word32 g_dw4000A545;
word32 g_dw4000A546;
int32 g_dw4000A564;
uint32 g_dw4000A568;
int32 g_dw4000A584;
int32 g_dw4000A588;
int32 g_dw4000A598;
int32 g_dw4000A59C;
int32 g_dw4000A5A0;
Eq_478601 g_t4000A5BC;
Eq_366565 g_t4000C000;
word32 * g_ptr4000C10C;
word32 g_dw4000C110;
word32 g_dw4000C111;
struct Eq_18942 * g_ptr4000E400;
int32 g_dw4000E404;
struct Eq_18955 * g_ptr4000E418;
int32 g_dw4000E41C;
int32 g_dw4000F814;
Eq_9331 g_t4000F884;
int32 g_dw4000F90C;
int32 g_dw4000F910;
Eq_476784 g_t4000F914;
int32 g_dw4000F938;
struct Eq_18747 * g_ptr40010814;
Eq_9217 g_t40010884;
ui32 g_dw4001090C;
ui32 g_dw40010910;
ui32 g_dw40010914;
ui32 g_dw40010938;
Eq_24700 g_t40030000;
Eq_537297 g_t410588B3;
Eq_83447 g_t4154535F;
int32 g_dw42028F44;
byte g_b42049C00;
struct Eq_13556 * g_ptr43001148;
byte g_b4301EB5A;
byte g_b4301EB71;
word32 g_dw4301EBEC;
word32 g_dw4301EC4C;
byte g_b4301ED0A;
byte g_b4301ED21;
word32 g_dw4301ED9C;
word32 g_dw4301EDFC;
Eq_537 g_t43023AF4;
word32 g_dw43023E9C;
Eq_123041 g_t43023F3C;
Eq_112287 g_t43024654;
uint16 g_w4302468C;
int32 g_dw43024700;
byte g_b44045FC4;
Eq_2 g_t4444445C;
Eq_6646 g_t44800000;
ui32 g_dw44800100;
int32 g_dw44800104;
int32 g_dw44800108;
int32 g_dw4480010C;
int32 g_dw44800110;
int32 g_dw44800114;
word32 g_dw44800118;
int32 g_dw4480011C;
int32 g_dw44800140;
Eq_6181 g_t44900000;
int32 g_dw449000E0;
word32 g_dw44910040;
int32 g_a44A00080[6];
int32 g_dw44A00094;
word16 g_w44A000A4;
word16 g_w44A000AC;
struct Eq_20209 * g_ptr44B00000;
struct Eq_74818 * g_ptr44B00004;
ui32 g_dw44B00038;
uint32 g_dw44B0004C;
int32 g_dw44B00090;
int32 g_dw44B0009C;
int32 g_dw44B000A0;
byte * g_ptr44B000AC;
byte * g_ptr44B000B0;
byte * g_ptr44B000B4;
byte * g_ptr44B000B8;
ui32 g_dw44B000BC;
ui32 g_dw44B000C0;
Eq_19879 g_t44B000C4;
Eq_19650 g_t44B000D8;
word32 g_dw44B000DC;
Eq_19347 g_t44B000E4;
Eq_19395 g_t44B000E8;
Eq_19415 g_t44B000EC;
int32 g_dw44B000F0;
Eq_19469 g_t44B000F4;
Eq_19489 g_t44B000F8;
Eq_19510 g_t44B00104;
Eq_2 g_t44B00120;
Eq_2 g_a44B00128[];
Eq_2 g_t44B00144;
Eq_2 g_t44B00148;
Eq_2 g_t44B00200;
Eq_2 g_t44B00204;
Eq_2 g_t44B00208;
Eq_2 g_t44B0020C;
int32 g_dw44B00400;
word32 g_dw44B00404;
struct Eq_73839 * g_ptr44B00500;
struct Eq_73845 * g_ptr44B00504;
struct Eq_73865 * g_ptr44B0050C;
int32 g_dw44B00510;
Eq_27957 g_t44B08000;
struct Eq_19281 * g_ptr44B08004;
struct Eq_19281 * g_ptr44B08008;
word32 g_dw44B08080;
Eq_19267 g_t44B08084;
Eq_19267 g_t44B08088;
Eq_2 g_t44B0808C;
Eq_2 g_t44B080A4;
struct Eq_21405 * g_ptr44B080A8;
ui32 g_dw44B08160;
ui32 g_dw44B08164;
int32 g_dw44B08168;
Eq_2 g_t44B08180;
Eq_32915 g_t44B08188;
int32 g_dw44B08198;
int32 g_dw44B0819C;
int32 g_dw44B081A0;
int32 g_dw44B081A4;
int32 g_dw44B081A8;
Eq_2 g_t44B081B8;
Eq_2 g_t44B081BC;
Eq_2 g_t44B08548;
Eq_2 g_t44B0854C;
ptr32 * g_ptr44C00000;
int32 g_dw44C00818;
int32 g_dw44C0081C;
int32 g_dw44C00820;
int32 g_dw44C00824;
int32 g_dw44C00830;
Eq_7792 g_t44C00834;
int32 g_dw44C00858;
int32 g_dw44C00874;
uint32 g_dw44C01000;
word32 g_dw44C01800;
ui32 g_dw44C01818;
ui32 g_dw44C0181C;
struct Eq_7756 * g_ptr44C01820;
int32 g_dw44C01824;
ui32 g_dw44C01830;
ui32 g_dw44C01834;
int32 g_dw44C01838;
word32 g_dw44C0183C;
ui32 g_dw44C01858;
word32 g_dw44C01860;
ui32 g_dw44C01874;
word32 g_dw44C01888;
word32 g_dw44C0188C;
word32 g_dw44C01898;
word32 g_dw44C0189C;
word32 g_dw44C03030;
int32 g_dw44C0B000;
word32 g_dw44C0B118;
word32 g_dw44C0B340;
word32 g_dw44C0B344;
word32 g_dw44C0B348;
int32 g_dw44C0B364;
int32 g_dw44C0B368;
int32 g_dw44C0B36C;
int32 g_dw44C0B370;
int32 g_dw44C0B380;
int32 g_dw44C0B384;
int32 g_dw44C0B388;
int32 g_dw44C0B38C;
int32 g_dw44C0B390;
int32 g_dw44C0B394;
int32 g_dw44C0B398;
int32 g_dw44C0B3A0;
int32 g_dw44C0B3A4;
word32 g_dw44C0B3BC;
Eq_7209 g_t44C0B3C0;
int32 g_dw44C0B3C4;
int32 g_dw44C0B414;
int32 g_dw44C0B41C;
int32 g_dw44C0B420;
struct Eq_8272 ** g_ptr44C0B500;
int32 g_dw44C0C080;
int32 g_dw44C0C084;
int32 g_dw44C0C088;
int32 g_dw44C0C218;
int32 g_dw44C0C814;
int32 g_dw44C0C82C;
struct Eq_7499 * g_ptr44C0C830;
int32 g_dw44C0C838;
int32 g_dw44C0C83C;
int32 g_dw44C0C840;
ui32 g_dw44C0D814;
ui32 g_dw44C0D82C;
ui32 g_dw44C0D830;
ui32 g_dw44C0D838;
ui32 g_dw44C0D83C;
ui32 g_dw44C0D840;
Eq_131057 g_t45018082;
Eq_472928 g_t491CC8A1;
Eq_126409 g_t4B4D2020;
word32 g_dw50100023;
Eq_421201 g_t50EF9782;
Eq_2 g_t510E5297;
Eq_8330 g_t54C0A000;
Eq_8330 g_t54C0A800;
word32 g_a54C0B000[512];
Eq_2 g_t55555571;
Eq_502498 g_t5BE0CD19;
Eq_2 g_t5BE0CD3D;
<anonymous> g_t616C6572;
Eq_126409 g_t619000EF;
Eq_2 g_t64F98FC7;
Eq_2 g_t66666686;
struct Eq_92191 * g_ptr67452301;
struct Eq_549992 * g_ptr67452309;
Eq_2 g_t6858152D;
Eq_2 g_t6A09E66F;
Eq_421201 g_t6B440413;
Eq_505993 g_t6E6B6E75;
Eq_36656 g_t70EFB284;
Eq_557915 g_t72727543;
Eq_2 g_t77777777;
Eq_2 g_t7777777B;
Eq_2 g_t7777779B;
word32 g_dw7F020A53;
