pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at.globals.c
Eq_2 g_t7F7F7F7F;
word32 g_dw7FFFFFDE;
word32 g_dw80000000;
word32 g_dw8000001C;
struct Eq_19656 * g_ptr8000003E;
word32 g_dw80000074;
struct Eq_19656 * g_ptr800A080C;
Eq_493419 g_t8082B7FD;
Eq_131057 g_t8082DB1C;
struct Eq_19592 * g_ptr83000198;
struct Eq_19592 * g_ptr8373F198;
word32 g_dw8373F1C0;
struct Eq_19656 * g_ptr840A080C;
Eq_472928 g_t842EC05A;
Eq_131057 g_t879307F0;
Eq_131057 g_t8F09C226;
Eq_126409 g_t90EFC9C5;
Eq_583584 g_t923F82A4;
Eq_537297 g_t973200F5;
struct Eq_92191 * g_ptr98BADD06;
struct Eq_549992 * g_ptr98BADD0E;
Eq_2 g_t9B0568A8;
Eq_583584 g_t9BDC06A7;
Eq_2 g_tA54FF54E;
word32 g_dwA6E0A6A0;
word32 g_dwA6E2A6A2;
word32 g_dwA6E7A6A7;
word32 g_dwA6EFA6AF;
word32 g_dwA6F1A6B1;
word32 g_dwA732A6EB;
word32 g_dwA734A6ED;
word32 g_dwA739A6F2;
word32 g_dwA741A6FA;
word32 g_dwA743A6FC;
word32 g_dwA7C0A77D;
word32 g_dwA7C2A77F;
word32 g_dwA7C7A784;
word32 g_dwA7D0A78C;
word32 g_dwA7D1A78E;
word32 g_dwA84FA810;
word32 g_dwA850A811;
word32 g_dwA855A816;
word32 g_dwA85EA81F;
word32 g_dwA860A821;
word32 g_dwA8DDA8A2;
word32 g_dwA8DEA8A3;
word32 g_dwA8E4A8A8;
word32 g_dwA8ECA8B1;
word32 g_dwA8EEA8B3;
word32 g_dwA96BA934;
word32 g_dwA96DA935;
word32 g_dwA972A93B;
word32 g_dwA97AA943;
word32 g_dwA97CA945;
word32 g_dwA9F9A9C6;
word32 g_dwA9FBA9C8;
word32 g_dwAA00A9CD;
word32 g_dwAA09A9D5;
word32 g_dwAA0AA9D7;
word32 g_dwAA87AA58;
word32 g_dwAA89AA5A;
word32 g_dwAA8EAA5F;
word32 g_dwAA97AA68;
word32 g_dwAA99AA6A;
Eq_2 g_tAAAAAC6F;
Eq_2 g_tAAAAAC73;
word32 g_dwAB16AAEB;
word32 g_dwAB17AAEC;
word32 g_dwAB1CAAF1;
word32 g_dwAB25AAFA;
word32 g_dwAB27AAFC;
word32 g_dwABA4AB7D;
word32 g_dwABA5AB7E;
word32 g_dwABABAB84;
word32 g_dwABB3AB8C;
word32 g_dwABB5AB8E;
word32 g_dwAC32AC0F;
word32 g_dwAC34AC10;
word32 g_dwAC39AC16;
word32 g_dwAC42AC1E;
word32 g_dwAC43AC20;
Eq_421201 g_tAD4FD0EF;
Eq_344485 g_tB07342A1;
Eq_131057 g_tB4040413;
Eq_2 g_tBAADF00D;
struct Eq_33914 * g_ptrBADCAB1E;
Eq_2 g_tBB67AE91;
Eq_33985 g_tBDFBA3F0;
byte g_bBDFDE885;
Eq_220549 g_tBDFEBBA8;
Eq_14363 g_tBDFEE24C;
byte g_bBDFF0BFC;
byte g_bBDFF0C10;
byte g_bBDFF2FB4;
Eq_502498 g_tBEFA4FA4;
Eq_31995 g_tC0000000;
Eq_2 g_tC0DEDBAD;
Eq_2 g_tC1059EE0;
struct Eq_92191 * g_ptrC3D2E200;
struct Eq_549992 * g_ptrC3D2E208;
Eq_131057 g_tC5034200;
Eq_537297 g_tC601C509;
Eq_131057 g_tC6061141;
Eq_537297 g_tC629C531;
Eq_421201 g_tC62A415C;
Eq_537297 g_tC9158082;
Eq_537297 g_tCA0DC915;
Eq_2 g_tCAFEBAC2;
word32 g_dwCAFEFAEE;
Eq_2 g_tCAFEFB16;
Eq_265444 g_tCE4ED226;
byte g_bDCF3452C;
byte g_bDCF346A0;
Eq_14153 g_tDCF54D44;
Eq_14153 g_tDCF54DC4;
word32 g_dwE400004B;
struct Eq_92191 * g_ptrEFCDAB8D;
struct Eq_549992 * g_ptrEFCDAB95;
Eq_16803 g_tF0000000;
struct Eq_81007 * g_ptrF0000714;
word32 g_dwF2026078;
struct Eq_77802 * g_ptrF3FFF820;
word32 g_dwF4000014;
Eq_2 g_tF70E594D;
Eq_2 g_tF8000008;
Eq_471974 g_tF8000100;
Eq_129045 g_tF800033C;
Eq_2 g_tF8FFFE04;
Eq_471974 g_tF8FFFF00;
<anonymous> g_tF9000700;
Eq_2 g_tF9000724;
Eq_486509 g_tF9000780;
Eq_133897 g_tFA00055A;
word32 g_dwFA00055E;
struct Eq_135848 * g_ptrFA000562;
Eq_2 g_tFBFFFE00;
struct Eq_77060 * g_ptrFF000684;
word32 g_dwFF6769B4;
Eq_14654 g_tFF709140;
word32 g_dwFF76ABDC;
word32 g_dwFF76AC0C;
Eq_14657 g_tFF85EE00;
word32 g_dwFF85EE24;
word32 g_dwFF85EE44;
Eq_33313 g_tFF87FFFF;
word32 g_dwFF88FB5C;
struct Eq_19656 * g_ptrFF9000C8;
word32 g_dwFF95307C;
word32 g_dwFFB3B4EC;
word32 g_dwFFBCDCD4;
Eq_2 g_tFFC00B49;
word32 g_dwFFC2F714;
word32 g_dwFFC2F744;
word32 g_dwFFC2F76C;
word32 g_dwFFD2395C;
word32 g_dwFFD2397C;
word32 g_dwFFD2399C;
word32 g_dwFFD54694;
Eq_14657 g_tFFE17B80;
word32 g_dwFFE17BB4;
Eq_99351 g_tFFF053FE;
Eq_537297 g_tFFF58693;
Eq_14232 g_tFFFFFE40;
Eq_2 g_aFFFFFFBE[];
Eq_2 g_tFFFFFFCB;
Eq_492553 g_tFFFFFFE0;
Eq_2 g_tFFFFFFE6;
Eq_213828 g_tFFFFFFEA;
Eq_182061 g_tFFFFFFED;
Eq_517266 g_tFFFFFFEE;
Eq_182061 g_tFFFFFFF0;
word32 g_dwFFFFFFF2;
word32 g_dwFFFFFFF3;
struct Eq_429487 * g_ptrFFFFFFF5;
Eq_14455 g_tFFFFFFF6;
ptr32 g_ptrFFFFFFF8;
Eq_2 g_tFFFFFFFA;
Eq_409305 g_tFFFFFFFB;
Eq_56079 g_tFFFFFFFD;
Eq_2 g_tFFFFFFFE;
Eq_2 g_tFFFFFFFF;
